{
  "rss": {
    "layout": false
  },
  "liquid-wintersmith-templates": {
    "title": "Supporting Liquid Templates in Wintersmith",
    "byline": "Liquid is a simple, secure and stateless template engine",
    "date": "August 22, 2013",
    "description": "I've gotten used to Liquid from using Jekyll and Octopress. When I took Wintersmith for a spin I sort of missed Liquid. So I created a template plugin for Liquid that uses the liquid-node module to render Liquid templates.",
    "tags": ["code"],
    "layout": "../_layouts/standard"
  },
  "solarized-dark-theme-for-textual": {
    "title": "Solarized Dark theme for Textual",
    "byline": "Textual is a lightweight IRC client created specifically for Mac OS X",
    "date": "August 23, 2013",
    "description": "After looking through the available themes for Textual, one of the best IRC clients for Mac OS X, I decided to roll my own Solarized Dark theme by cloning the Sapientia theme packaged with Textual.",
    "tags": ["code"],
    "layout": "../_layouts/standard"
  },
  "monitor-geddy-apps-with-new-relic": {
    "title": "Monitor Geddy apps with New Relic",
    "byline": "Using New Relic's Node.js agent to monitor Geddy applications",
    "date": "October 24, 2013",
    "description": "Having used New Relic for other projects I of course jumped on the chance to get started with New Relic for Node.js when my sales contact reached out to me right after the beta ended. I’ve got several projects using Geddy, which is not supported out of the box, so I had to do some customization.",
    "tags": ["node"],
    "layout": "../_layouts/standard"
  },
  "review-intel-nuc6i3syh-skylake": {
    "title": "Review: Mini-PC Intel NUC Kit NUC6i3SYH",
    "byline": "The Broken Memories of Princess Skylake; or How to match the correct RAM to your new NUC6i3SYH",
    "date": "March 19, 2016",
    "description": "A couple of weeks ago my Intel NUC6i3SYH Mac Mini killer arrived. Unfortunately Newegg bundled it with the wrong RAM. Unbeknownst to me, the new Skylake architecture Intel NUCs are very particular when it comes to the types and makes of memory modules. Through some reading as well as trial and error I finally found RAM that worked.",
    "tags": ["nuc", "review"],
    "layout": "../_layouts/standard",
    "rating": {
      "Ease of installation": 2.5,
      "Overall experience": 4.5,
      "Overall value": 5
    }
  }
}
